input_openfoam/tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

./Allrun.mesh

restore0Dir
runApplication decomposePar -force
runParallel rhoSimpleFoam

#------------------------------------------------------------------------------
